#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 6: Guard Gallivant
#+AUTHOR: Michael R. Mauger
#+DATE: [Sat Dec  7 01:06:15 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_SRC bash :results output
  guile3.0 --no-auto-compile --r7rs guard-gallivant.scm example.dat
  # guile3.0 --no-auto-compile --r7rs guard-gallivant.scm input.dat
#+END_SRC

#+RESULTS:
: Part One: Day 6: Guard Gallivant in "example.dat": 41
: (obstruct 0 0)
: (guard: (6 . 4))
: (exception thrown wrong-type-arg (#f Wrong type to apply: ~S (#f) (#f)))
